tap "homebrew/services"
tap "koekeishiya/formulae"
brew "jpeg-turbo"
brew "libtiff"
brew "atlas"
brew "gettext"
brew "openssl@3"
brew "openjpeg"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "git"
brew "git-gui"
brew "git-lfs"
brew "ical-buddy"
brew "jpeg"
brew "lapack"
brew "libgpg-error"
brew "libffi"
brew "libusb"
brew "navi"
brew "node"
brew "openblas"
brew "numpy"
brew "pinentry-mac"
brew "sqlite"
brew "python@3.13"
brew "pipx"
brew "pstree"
brew "python@3.12"
brew "smartmontools"
brew "symlinks"
brew "wget"
brew "zlib"
brew "zlib-ng"
vscode "076923.python-image-preview"
vscode "10f.laetus"
vscode "4gray.vsc-github-trending"
vscode "4tron.stack-overflow-view"
vscode "aaron-bond.better-comments"
vscode "aaronyoung.dark-synthwave-vscode"
vscode "abhivijay96.bot-compiler-schema-support"
vscode "actuallyzach.jelly-language-support"
vscode "adobeexl.adobe-markdown-authoring"
vscode "ahmadawais.shades-of-purple"
vscode "akamud.vscode-theme-onedark"
vscode "akamud.vscode-theme-onelight"
vscode "akashrajendra.web-search"
vscode "akfish.vscode-devdocs"
vscode "al3xcubed.theme-cubed"
vscode "alefragnani.project-manager"
vscode "alicannklc.phpsearch"
vscode "allan-carlos.night-rainbow"
vscode "alperg.markdown-vscode"
vscode "amodio.amethyst-theme"
vscode "analytic-signal.preview-html"
vscode "anan.devdocstab"
vscode "andriniaina.fsharp-interactive-datascience"
vscode "anseki.vscode-color"
vscode "antonreshetov.masscode-assistant"
vscode "anysphere.pyright"
vscode "aregghazaryan.glass-ui"
vscode "artursponchiado.orangeflavor"
vscode "ashpowell.monokai-one-dark-vivid"
vscode "atlantjs.atlantjs-themes"
vscode "avetis.codeme-theme"
vscode "avidworks.vampiro"
vscode "b3hr4d.colorful-darkplus"
vscode "balazs4.gitlab-pipeline-monitor"
vscode "beardedbear.beardedicons"
vscode "beastdestroyer.firefox-quantum-themes"
vscode "betaiandmark.search-similar-code"
vscode "bezbac.concrete-vscode"
vscode "bibhasdn.django-html"
vscode "bibhasdn.django-snippets"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "blake-mealey.generate-wt-scheme"
vscode "bradgashler.htmltagwrap"
vscode "branchcreation.repository"
vscode "branchcreation.repository-vscode-extensions"
vscode "buianhthang.xml2json"
vscode "burnsra.theme-burnsra-personal-vscode"
vscode "carrie999.cyberpunk-2020"
vscode "cgrevisse.swift-project-creation"
vscode "chadderbox.monokai-vibrant-amped"
vscode "chenxsan.vscode-standard-format"
vscode "chneau.saturated-dark-plus"
vscode "chouzz.vscode-better-align"
vscode "christian-kohler.path-intellisense"
vscode "cmoog.sqlnotebook"
vscode "codereviewer14.cyber77-vscode"
vscode "codestream.codestream"
vscode "codezombiech.gitignore"
vscode "crawron.magpix"
vscode "cweijan.vscode-office"
vscode "danmeeusen.deep-default-dark-vscode-theme"
vscode "darkriszty.markdown-table-prettify"
vscode "dart-code.dart-code"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dbeff.universum"
vscode "dcasella.monokai-plusplus"
vscode "deerawan.vscode-dash"
vscode "developerskull.github-vsc"
vscode "docsmsft.docs-markdown"
vscode "docsmsft.docs-preview"
vscode "donjayamanne.python-environment-manager"
vscode "dotjoshjohnson.xml"
vscode "drkryz.drkryz-theme"
vscode "dsznajder.es7-react-js-snippets"
vscode "dumpvn.search-github"
vscode "dunstontc.dark-plus-syntax"
vscode "dzhavat.git-cheatsheet"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "edgaraldair.vintage-vibrance"
vscode "eliverlara.andromeda"
vscode "eliverlara.sweet-vscode"
vscode "eliverlara.sweet-vscode-icons"
vscode "endormi.2077-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "ericsia.pythonsnippets3"
vscode "esbenp.prettier-vscode"
vscode "fabianlauer.vs-code-xml-format"
vscode "fabiospampinato.vscode-open-in-github"
vscode "falberthen.gitmarker"
vscode "felipecaputo.git-project-manager"
vscode "fernandotimo.timoideas-themes"
vscode "fivepointseven.vscode-theme-onedark-spacegray"
vscode "flowtype.flow-for-vscode"
vscode "fooxly.themeswitch"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.github-actions"
vscode "foxundermoon.shell-format"
vscode "frenco.vscode-notion"
vscode "frhtylcn.pythonsnippets"
vscode "fsdevon.one-dark-plus"
vscode "futureglobe.sepaswitch"
vscode "gcazaciuc.vscode-flow-ide"
vscode "gimenete.github-linker"
vscode "github.codespaces"
vscode "github.vscode-pull-request-github"
vscode "goessner.mdmath"
vscode "goliafrs.monokai-grs"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "helgardrichard.helium-icon-theme"
vscode "htwx.json-and-jsonc"
vscode "ibm.output-colorizer"
vscode "icao.electron-vue"
vscode "idleberg.hopscotch"
vscode "illixion.vscode-vibrancy-continued"
vscode "ionide.ionide-fsharp"
vscode "ivangabriele.vscode-git-add-and-commit"
vscode "jakob101.relativepath"
vscode "jbenden.c-cpp-flylint"
vscode "jebbs.markdown-extended"
vscode "jeylanib.pine-editor-themes"
vscode "jithurjacob.nbpreviewer"
vscode "jocapc.managed-instance-dashboard"
vscode "joelcrosby.one-dark-darker"
vscode "johnpapa.vscode-peacock"
vscode "jorgeserrano.vscode-csharp-snippets"
vscode "julialang.language-julia"
vscode "jyee721.gitlab-snippets"
vscode "kasik96.swift"
vscode "kevinrose.vsc-python-indent"
vscode "kgscott.tmnt-dark"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "kumar-harsh.graphql-for-vscode"
vscode "kuscamara.hyper-dark-material"
vscode "kyleerickson.night-rider"
vscode "lamdev.vscode-dark-theme"
vscode "larscom.monokai-dark-vibrant"
vscode "leizongmin.node-module-intellisense"
vscode "liximomo.remotefs"
vscode "logerfo.gitlab-notifications"
vscode "louiswt.regexp-preview"
vscode "lovemo.swift-perfect"
vscode "lsadam0.reactflowsnippets"
vscode "lucafluri.dark-lemon-material"
vscode "lukinco.lukin-vscode-theme"
vscode "magicstack.magicpython"
vscode "malloydata.malloy-vscode"
vscode "mariorodeghiero.vue-theme"
vscode "markthomasmiller.sorcerer"
vscode "mathiassoeholm.markdown-link-updater"
vscode "maurobalades.dark-flow-vscode"
vscode "max-ss.cyberpunk"
vscode "mayowapitan.true-dark-github-theme"
vscode "mccarter.start-git-bash"
vscode "mdickin.markdown-shortcuts"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "mgesbert.python-path"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "mohsen1.prettify-json"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-de"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.gather"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-ai"
vscode "ms-toolsai.vscode-ai-remote"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.powershell"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.theme-markdownkit"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-vscode.vscode-typescript-next"
vscode "mtxr.sqltools"
vscode "muhammadramzan.vibrant-dark-plus"
vscode "mukundan.python-docs"
vscode "neilbarkhina.gitdownloadazurerepos"
vscode "neuron.neuron-ipe"
vscode "niccolomineo.default-dark-plus-intellij"
vscode "nickdemayo.vscode-json-editor"
vscode "nigelvm.monokai-luminous"
vscode "nils-ballmann.python-coding-tools"
vscode "nitrous-cloud.nitrous-vscode-color-theme"
vscode "niudai.remote-github"
vscode "oderwat.indent-rainbow"
vscode "odibje.one-dark-orange"
vscode "olivercederborg.modern-monokai"
vscode "ornithologist.ios-snippets"
vscode "ozaki.markdown-github-dark"
vscode "pascalpixel.cameo"
vscode "pavan.vsnotebooks"
vscode "pflannery.vscode-versionlens"
vscode "photonsh.vscode-photon-theme"
vscode "pieterjongsma.swift-playgrounds"
vscode "piotrpalarz.vscode-gitignore-generator"
vscode "piperunner.neon-shimmer"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "pranaygp.vscode-css-peek"
vscode "pshershov.blueberry-banana"
vscode "psykosoldi3r.vscode-git-flow"
vscode "pulkitgangwar.nextjs-snippets"
vscode "qezhu.gitlink"
vscode "quicktype.quicktype"
vscode "randomfractalsinc.geo-data-viewer"
vscode "randomfractalsinc.vscode-data-preview"
vscode "rayated.ray-s-vibrant"
vscode "re-do.redo-rainbow-theme"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "redwan-hossain.skillavid-pure-black"
vscode "richie5um2.vscode-sort-json"
vscode "rimuruchan.vscode-fix-checksums-next"
vscode "rintoj.json-organizer"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "rocketseat.theme-omni"
vscode "rubyjasmin.hyperterm-theme"
vscode "s-kainet.sharepoint-typed-item"
vscode "s3gf4ult.monokai-vibrant"
vscode "sandorengholm.csspreview"
vscode "sashapetrenko.dark-future"
vscode "saurabh.terminal-manager"
vscode "sbrink.elm"
vscode "seansassenrath.vscode-theme-superonedark"
vscode "searking.preview-vscode"
vscode "shaharkazaz.git-merger"
vscode "shakram02.bash-beautify"
vscode "shpiglify.super-default"
vscode "siqilu.monokai-sharp"
vscode "sitego.spgo"
vscode "smithchayse92.dark-colored-theme"
vscode "spmeesseman.vscode-taskexplorer"
vscode "stelo.icykiss"
vscode "steoates.autoimport"
vscode "sunilyadav.dspysnippets"
vscode "syler.sass-indented"
vscode "szastupov.one-dark-pale"
vscode "tal7aouy.icons"
vscode "taymizami.vibra"
vscode "thekalinga.bootstrap4-vscode"
vscode "thomaskarachristos.terminal-statusbar"
vscode "tinkertrain.theme-panda"
vscode "tmcginn.insight"
vscode "tuguldurio.monokai-aora"
vscode "tushortz.theme-wildlife"
vscode "twin-themes.twin-vsc"
vscode "twxs.cmake"
vscode "tyriar.theme-sapphire"
vscode "uguraktas.nanothemes"
vscode "uloco.theme-bluloco-dark"
vscode "uloco.theme-bluloco-light"
vscode "usernamehw.errorlens"
vscode "vinirossa.vscode-webdev-pack"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vknabel.vscode-swiftformat"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vsls-contrib.gistfs"
vscode "vsls-contrib.gitdoc"
vscode "wallabyjs.quokka-vscode"
vscode "wesbos.theme-cobalt2"
vscode "whizkydee.material-palenight-theme"
vscode "wmontalvo.vsc-jsonsnippets"
vscode "wraith13.open-in-github-desktop"
vscode "xabikos.javascriptsnippets"
vscode "yardensachs.copy-python-path"
vscode "yasht.terminal-all-in-one"
vscode "yigitozgumus.nbconverter"
vscode "youssef.viow"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zaaack.markdown-editor"
vscode "zainchen.json"
vscode "zhang-renyang.chat-gpt"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
